audit/evidence/loadtest_nolimit_c1000.txt
npm warn config production Use `--omit=dev` instead.
Running 10s test @ http://localhost:3017/api/v1/projects
1000 connections


┌─────────┬────────┬────────┬────────┬────────┬───────────┬──────────┬─────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%  │ 99%    │ Avg       │ Stdev    │ Max     │
├─────────┼────────┼────────┼────────┼────────┼───────────┼──────────┼─────────┤
│ Latency │ 148 ms │ 199 ms │ 333 ms │ 739 ms │ 213.78 ms │ 95.87 ms │ 1658 ms │
└─────────┴────────┴────────┴────────┴────────┴───────────┴──────────┴─────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 2,751   │ 2,751   │ 4,779   │ 5,463   │ 4,634.1 │ 660.55  │ 2,751   │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 7.29 MB │ 7.29 MB │ 12.7 MB │ 14.5 MB │ 12.3 MB │ 1.75 MB │ 7.29 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 11

52k requests in 11.05s, 135 MB read