audit/evidence/loadtest_nolimit_c500.txt
npm warn config production Use `--omit=dev` instead.
Running 10s test @ http://localhost:3017/api/v1/projects
500 connections


┌─────────┬───────┬───────┬────────┬────────┬──────────┬──────────┬────────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5%  │ 99%    │ Avg      │ Stdev    │ Max    │
├─────────┼───────┼───────┼────────┼────────┼──────────┼──────────┼────────┤
│ Latency │ 81 ms │ 91 ms │ 167 ms │ 209 ms │ 96.58 ms │ 23.29 ms │ 309 ms │
└─────────┴───────┴───────┴────────┴────────┴──────────┴──────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 3,143   │ 3,143   │ 4,979   │ 5,827   │ 5,114.5 │ 747.56  │ 3,142   │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 8.33 MB │ 8.33 MB │ 13.2 MB │ 15.4 MB │ 13.6 MB │ 1.98 MB │ 8.33 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 10

52k requests in 10.03s, 136 MB read