audit/evidence/loadtest_nolimit_c5000.txt
npm warn config production Use `--omit=dev` instead.
Running 10s test @ http://localhost:3017/api/v1/projects
5000 connections


┌─────────┬────────┬────────┬─────────┬─────────┬────────────┬────────────┬─────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%   │ 99%     │ Avg        │ Stdev      │ Max     │
├─────────┼────────┼────────┼─────────┼─────────┼────────────┼────────────┼─────────┤
│ Latency │ 467 ms │ 816 ms │ 5232 ms │ 7497 ms │ 1020.08 ms │ 1140.09 ms │ 9697 ms │
└─────────┴────────┴────────┴─────────┴─────────┴────────────┴────────────┴─────────┘
┌───────────┬─────────┬─────────┬───────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%   │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼───────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 2,991   │ 2,991   │ 4,899 │ 5,383   │ 4,758   │ 672.49  │ 2,990   │
├───────────┼─────────┼─────────┼───────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 7.92 MB │ 7.92 MB │ 13 MB │ 14.3 MB │ 12.6 MB │ 1.78 MB │ 7.92 MB │
└───────────┴─────────┴─────────┴───────┴─────────┴─────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 11

58k requests in 11.16s, 139 MB read
448 errors (0 timeouts)